[
    {
      "_id": "6051e202aa5742268f8e6c9c",
      "auteur": "Jefferson Guzman",
      "dateDeRendu": "2015-11-03 12:55:19",
      "rendu": true,
      "note": 20,
      "typeDevoir": "Devoir Maison",
      "matiere": "BD",
      "remarques": "Reprehenderit nulla ex enim commodo veniam reprehenderit ullamco cupidatat. Deserunt sint dolore minim pariatur est officia voluptate et veniam cillum. Laboris aute elit voluptate mollit minim mollit ipsum culpa Lorem non culpa tempor elit commodo.",
      "nom": "Devoir Maison de BD",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203570b9ed9c7a48689",
      "auteur": "Mcguire Joyce",
      "dateDeRendu": "2018-09-30 08:37:04",
      "rendu": true,
      "note": 15,
      "typeDevoir": "Exercice",
      "matiere": "SI",
      "remarques": "Non adipisicing cupidatat aute adipisicing qui ullamco sunt velit aliqua voluptate anim. Do adipisicing mollit cillum ullamco occaecat reprehenderit culpa. Ullamco elit pariatur amet labore laboris magna enim ullamco laboris. Reprehenderit nisi irure dolor est voluptate minim duis occaecat. Culpa anim sint proident eu incididunt consectetur minim. Enim elit voluptate eu amet dolore ullamco laboris nostrud in exercitation aliquip. Pariatur laborum magna anim deserunt nostrud.",
      "nom": "Exercice de SI",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2035d046a5651f23629",
      "auteur": "Lorraine Duffy",
      "dateDeRendu": "2015-03-30 15:58:59",
      "rendu": true,
      "note": 19,
      "typeDevoir": "Exercice",
      "matiere": "WEB",
      "remarques": "Sit sunt dolor ea esse nostrud nostrud reprehenderit. Aute cupidatat in ut commodo. Qui excepteur ullamco sit aute commodo dolore nulla magna. Quis fugiat ex culpa duis aliquip esse proident ex aute.",
      "nom": "Exercice de WEB",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203242c871dfd5f28a4",
      "auteur": "Monique Knapp",
      "dateDeRendu": "2016-04-30 02:59:46",
      "rendu": true,
      "note": 7,
      "typeDevoir": "Partiel",
      "matiere": "Maths",
      "remarques": "Ex ad excepteur est nostrud minim. Ullamco magna anim ex magna est. Lorem Lorem et irure incididunt anim elit eiusmod eu ex ad. Commodo nulla aute irure ullamco irure eu Lorem est mollit. Velit consectetur culpa ea sint minim sint velit aliquip pariatur culpa qui est sunt ex. Aliquip cupidatat aute irure tempor culpa enim ex. Cupidatat sit ad elit proident.",
      "nom": "Partiel de Maths",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203404c49dc283460cb",
      "auteur": "Casandra Moses",
      "dateDeRendu": "2014-06-30 03:22:46",
      "rendu": true,
      "note": 14,
      "typeDevoir": "Rattrapage",
      "matiere": "Maths",
      "remarques": "Consequat in ullamco fugiat culpa ipsum fugiat anim consequat. In non non aute cillum ea sit exercitation ad excepteur dolor enim ex nostrud. Laboris incididunt aliquip mollit mollit sint eu pariatur ad. Dolor dolore aliqua culpa mollit fugiat voluptate consectetur eu anim officia sit.",
      "nom": "Rattrapage de Maths",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2030dde01652fa45ccc",
      "auteur": "Hogan Wagner",
      "dateDeRendu": "2014-02-04 11:43:17",
      "rendu": true,
      "note": 14,
      "typeDevoir": "Partiel",
      "matiere": "Deep Learning",
      "remarques": "Eiusmod irure voluptate irure ex dolor consequat Lorem non. Incididunt officia exercitation ullamco excepteur commodo consequat quis ad. Ut irure laborum sint dolore dolore mollit pariatur tempor qui non.",
      "nom": "Partiel de Deep Learning",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203dfbd4fbc54b20a18",
      "auteur": "Margarita Farley",
      "dateDeRendu": "2020-05-28 11:20:15",
      "rendu": true,
      "note": 16,
      "typeDevoir": "Partiel",
      "matiere": "Computer Vision",
      "remarques": "Sit elit cupidatat elit in. Sit velit dolor aliquip nostrud mollit sit proident veniam ut dolore qui ut. Eiusmod eiusmod anim consectetur sint minim. Occaecat nisi veniam ea esse est. Culpa ad aute aliqua Lorem voluptate cillum ullamco aliquip irure. Aliqua ipsum pariatur amet pariatur.",
      "nom": "Partiel de Computer Vision",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203f75b18fb2ec84210",
      "auteur": "Kellie Case",
      "dateDeRendu": "2018-03-23 20:52:14",
      "rendu": true,
      "note": 15,
      "typeDevoir": "Partiel",
      "matiere": "JAVA",
      "remarques": "Deserunt fugiat excepteur ullamco veniam occaecat. Qui deserunt esse dolor deserunt. Cillum non et labore dolor ipsum fugiat. Aliquip mollit voluptate eiusmod ut ex enim et sunt. Ex commodo ipsum eu cupidatat id nisi adipisicing deserunt Lorem excepteur adipisicing veniam. Ex dolore labore dolor laboris ex sint laboris aute aliquip qui nostrud. Laboris voluptate eiusmod amet ipsum fugiat tempor mollit officia consectetur anim voluptate quis.",
      "nom": "Partiel de JAVA",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2039becba3ae6aa6647",
      "auteur": "Hull Hall",
      "dateDeRendu": "2015-08-25 16:56:38",
      "rendu": true,
      "note": 13,
      "typeDevoir": "TD",
      "matiere": "Histoire",
      "remarques": "Ut occaecat cillum do est est exercitation. Aliqua do magna aliqua adipisicing in. Fugiat in incididunt Lorem anim nisi velit et aute aliqua proident dolor ad. Culpa minim consectetur cupidatat deserunt voluptate. Duis est quis nulla in est enim do esse magna voluptate voluptate ad sint amet. Ut culpa laboris ea amet ut eu ullamco ullamco esse pariatur eu Lorem. Mollit mollit fugiat excepteur veniam dolor sint irure aute elit aute.",
      "nom": "TD de Histoire",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203fc835e03ef716b6d",
      "auteur": "Laurie Sawyer",
      "dateDeRendu": "2018-12-11 16:47:08",
      "rendu": true,
      "note": 13,
      "typeDevoir": "Rattrapage",
      "matiere": "SVT",
      "remarques": "Ea laboris elit dolor tempor velit est. Aliquip ex id sit irure ad ex laboris ullamco nulla nisi esse do ipsum cillum. Reprehenderit cupidatat non minim exercitation sit sint aliqua adipisicing eu veniam commodo excepteur. Reprehenderit aliquip labore ut voluptate. Elit pariatur aliquip in aliquip nulla enim incididunt laboris incididunt do sunt. Consequat tempor non duis minim voluptate minim commodo id. Incididunt id aute duis veniam ipsum tempor laboris anim tempor minim deserunt nostrud in deserunt.",
      "nom": "Rattrapage de SVT",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203167182a23581d08d",
      "auteur": "Herrera Gonzalez",
      "dateDeRendu": "2018-11-26 10:32:44",
      "rendu": true,
      "note": 17,
      "typeDevoir": "TP",
      "matiere": "WEB",
      "remarques": "Exercitation ut minim ex ipsum. Ad Lorem enim et aliqua ad fugiat veniam excepteur proident dolor ea. Voluptate non ad adipisicing quis culpa officia commodo velit ut est aute excepteur.",
      "nom": "TP de WEB",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203f238571d8935e8ee",
      "auteur": "Katheryn Flynn",
      "dateDeRendu": "2014-05-31 22:22:13",
      "rendu": true,
      "note": 19,
      "typeDevoir": "Exercice",
      "matiere": "Maths",
      "remarques": "Minim est proident mollit ad voluptate magna sunt reprehenderit nisi est ullamco nostrud. Nulla veniam dolor ea in exercitation magna nostrud. Aliqua veniam aute et exercitation laborum.",
      "nom": "Exercice de Maths",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203bc6d8839c66d3be0",
      "auteur": "Nellie Barker",
      "dateDeRendu": "2015-03-21 17:52:21",
      "rendu": true,
      "note": 1,
      "typeDevoir": "Partiel",
      "matiere": "JAVA",
      "remarques": "Ea culpa dolore esse cillum quis do nostrud eu elit excepteur in enim laborum. Officia amet ipsum Lorem dolor laboris fugiat enim. Ipsum voluptate deserunt ea duis excepteur adipisicing fugiat ex nisi veniam cillum. Fugiat laborum excepteur et ea mollit laborum commodo exercitation ut veniam aliquip minim quis dolore. Reprehenderit sint nulla excepteur exercitation.",
      "nom": "Partiel de JAVA",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203750a20ab0905c13b",
      "auteur": "Combs Whitehead",
      "dateDeRendu": "2015-05-15 14:17:15",
      "rendu": true,
      "note": 4,
      "typeDevoir": "Partiel",
      "matiere": "SI",
      "remarques": "Nostrud laboris ipsum excepteur consequat nisi duis quis. Ipsum ad ad ut enim proident dolor pariatur voluptate non nisi. Cupidatat laborum consequat in in commodo id. Officia anim dolore dolor mollit tempor enim eu labore id. Laborum aliqua non laborum qui ex nostrud nisi deserunt.",
      "nom": "Partiel de SI",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2037bfef09b2ec03919",
      "auteur": "Santana Fields",
      "dateDeRendu": "2015-07-26 10:01:18",
      "rendu": true,
      "note": 12,
      "typeDevoir": "Exercice",
      "matiere": "Deep Learning",
      "remarques": "Do ut nisi consequat ut sit commodo id pariatur. Nulla est in in sunt deserunt. Qui laboris fugiat dolore anim dolore pariatur do ullamco ex ad. Nulla officia ipsum elit officia.",
      "nom": "Exercice de Deep Learning",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e20325bae653f6206a27",
      "auteur": "Schwartz Daugherty",
      "dateDeRendu": "2016-08-16 14:13:41",
      "rendu": true,
      "note": 15,
      "typeDevoir": "Exercice",
      "matiere": "Machine Learning",
      "remarques": "Dolor laborum cillum amet ipsum eu laboris dolor est commodo amet sunt eiusmod. Laborum reprehenderit commodo veniam officia nostrud occaecat exercitation reprehenderit aliqua magna amet commodo. Veniam Lorem cupidatat occaecat sit. Nostrud commodo velit est nulla. Ut elit nisi Lorem consectetur magna duis id est ipsum anim.",
      "nom": "Exercice de Machine Learning",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203a7760af30d85fcee",
      "auteur": "Wilkinson Head",
      "dateDeRendu": "2020-04-17 08:26:22",
      "rendu": true,
      "note": 8,
      "typeDevoir": "Exercice",
      "matiere": "SVT",
      "remarques": "Adipisicing consectetur cupidatat consequat reprehenderit. Officia ex nulla consectetur nisi officia dolore aute est minim magna voluptate consectetur quis. Culpa aute sint ad id ad aliquip adipisicing dolore adipisicing. Fugiat proident dolor qui non officia velit non ut veniam esse deserunt ea. Fugiat laboris sit commodo aliqua sit occaecat est cillum officia. Pariatur ullamco est consequat est commodo commodo ea officia consectetur. Deserunt officia officia ullamco exercitation non sit velit minim.",
      "nom": "Exercice de SVT",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e20372f961bc24860d23",
      "auteur": "Elvira Wise",
      "dateDeRendu": "2016-10-14 21:22:29",
      "rendu": true,
      "note": 5,
      "typeDevoir": "Partiel",
      "matiere": "Anglais",
      "remarques": "Quis commodo incididunt cupidatat nisi in veniam. Dolor ex Lorem irure incididunt do elit aute. Commodo esse nulla esse proident cillum. Consequat ipsum nostrud non dolor fugiat aliqua sint consequat. Commodo consequat ipsum ea minim elit non enim do sit deserunt ad mollit ut amet. Ad excepteur qui deserunt eiusmod ad excepteur nulla. Commodo do irure laborum voluptate occaecat minim ut.",
      "nom": "Partiel de Anglais",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203cfbe7981b2b4c4c7",
      "auteur": "Arlene Clarke",
      "dateDeRendu": "2020-09-06 01:40:20",
      "rendu": true,
      "note": 1,
      "typeDevoir": "TD",
      "matiere": "SVT",
      "remarques": "Officia amet pariatur dolore culpa culpa consectetur dolore ad reprehenderit. Magna officia non occaecat tempor adipisicing. Fugiat reprehenderit ad et sint minim esse ullamco occaecat est aliquip deserunt laborum.",
      "nom": "TD de SVT",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203d4b5cdb36558f54d",
      "auteur": "Patsy Buck",
      "dateDeRendu": "2015-04-26 09:30:01",
      "rendu": true,
      "note": 7,
      "typeDevoir": "Partiel",
      "matiere": "Deep Learning",
      "remarques": "Sint fugiat adipisicing velit do elit laborum tempor cillum culpa. Laboris laboris exercitation irure consequat nostrud. Quis adipisicing dolor irure Lorem sint occaecat officia enim. Commodo laboris magna est ullamco aliqua. Ullamco eiusmod incididunt eiusmod ea do officia voluptate minim.",
      "nom": "Partiel de Deep Learning",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203eb9356a1a2de29c9",
      "auteur": "Staci Pate",
      "dateDeRendu": "2019-12-29 05:48:11",
      "rendu": true,
      "note": 8,
      "typeDevoir": "Devoir Maison",
      "matiere": "Histoire",
      "remarques": "Anim ea esse labore dolor laborum occaecat sit. Nisi cillum occaecat laborum Lorem consequat non pariatur id in. Consequat ut esse labore non velit culpa aliquip consequat. Sint excepteur culpa sit velit cillum. Ipsum ut labore labore aliquip aliqua nostrud fugiat ad fugiat irure deserunt commodo. Ut tempor ullamco officia labore quis fugiat esse ea ad fugiat et minim. Voluptate do et ea cillum anim mollit tempor.",
      "nom": "Devoir Maison de Histoire",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203cc4e68a9557ba949",
      "auteur": "Farmer Miller",
      "dateDeRendu": "2014-01-04 08:30:12",
      "rendu": true,
      "note": 20,
      "typeDevoir": "Exercice",
      "matiere": "Computer Vision",
      "remarques": "Ipsum ex aliqua laboris laboris aute laboris ex irure sunt laborum ut deserunt. In consectetur sunt sint proident. Proident deserunt incididunt aliqua occaecat Lorem elit veniam dolor. Elit nostrud ea minim magna culpa minim laboris ipsum ut pariatur.",
      "nom": "Exercice de Computer Vision",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203c66e6518fcf4b914",
      "auteur": "Lisa Summers",
      "dateDeRendu": "2015-10-18 01:52:42",
      "rendu": true,
      "note": 0,
      "typeDevoir": "Exercice",
      "matiere": "WEB",
      "remarques": "Ex qui et labore consectetur dolore enim consequat proident laboris ad. Excepteur officia dolor dolor ad in eu cupidatat minim aliquip. Pariatur id pariatur labore deserunt excepteur deserunt Lorem dolore nostrud.",
      "nom": "Exercice de WEB",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e20377dd07b88e417de3",
      "auteur": "Peck Mcneil",
      "dateDeRendu": "2015-03-17 03:54:10",
      "rendu": true,
      "note": 12,
      "typeDevoir": "TP",
      "matiere": "Computer Vision",
      "remarques": "Aliquip dolor mollit fugiat et duis aute. Eiusmod ex cupidatat incididunt pariatur commodo laborum ut anim aute cupidatat labore. Est reprehenderit ullamco exercitation cillum ea nisi Lorem deserunt cillum eu duis nostrud ad aliquip. Cillum anim proident ut anim. Culpa excepteur consectetur eiusmod aute eu.",
      "nom": "TP de Computer Vision",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2035f5e938971f9a5c0",
      "auteur": "Mildred Nicholson",
      "dateDeRendu": "2015-07-25 16:13:06",
      "rendu": true,
      "note": 10,
      "typeDevoir": "Exercice",
      "matiere": "Histoire",
      "remarques": "Ea exercitation cupidatat dolor sit anim magna consequat qui voluptate amet enim elit. Magna cillum do officia non id dolore veniam esse consectetur amet sint irure occaecat. Amet ut exercitation dolor veniam. Fugiat cupidatat non esse voluptate.",
      "nom": "Exercice de Histoire",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203c45d2799ea6fad58",
      "auteur": "Gates Mosley",
      "dateDeRendu": "2014-04-08 00:14:22",
      "rendu": true,
      "note": 14,
      "typeDevoir": "Rattrapage",
      "matiere": "Histoire",
      "remarques": "Culpa voluptate elit ipsum magna est eu Lorem Lorem occaecat enim Lorem amet. Labore qui eu dolore sit labore est aliqua dolore laborum nulla esse. Eiusmod consectetur nulla fugiat proident consectetur quis voluptate sunt in est in ullamco ullamco ad. Labore aliquip cillum laborum dolor exercitation deserunt ea aute laboris. Culpa veniam exercitation quis enim.",
      "nom": "Rattrapage de Histoire",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2033d45c13af2407e7b",
      "auteur": "Ava Levy",
      "dateDeRendu": "2020-12-13 17:27:09",
      "rendu": true,
      "note": 1,
      "typeDevoir": "TD",
      "matiere": "Maths",
      "remarques": "Dolore eu Lorem deserunt mollit dolore. Nulla dolore ea dolor id nulla nulla culpa. Id aute labore Lorem dolore occaecat magna proident proident aliqua adipisicing ullamco occaecat nulla. Pariatur enim magna laborum pariatur aliquip duis dolore duis nisi cupidatat Lorem occaecat proident. Occaecat do eiusmod incididunt ullamco fugiat velit aliqua cillum tempor.",
      "nom": "TD de Maths",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203ef32b7c9d86ce791",
      "auteur": "Karyn Burnett",
      "dateDeRendu": "2018-02-06 18:59:47",
      "rendu": true,
      "note": 13,
      "typeDevoir": "Devoir Maison",
      "matiere": "BD",
      "remarques": "Excepteur nisi duis anim non enim et dolore tempor non. Ea esse laboris nulla nulla ex. Officia velit sit cupidatat ullamco. Amet deserunt deserunt nulla amet laboris voluptate sit velit aute officia id commodo eiusmod. Ea culpa reprehenderit elit occaecat excepteur nisi ipsum do ullamco commodo id dolore. Pariatur veniam irure reprehenderit eiusmod excepteur culpa id cillum sunt nulla incididunt est et commodo. Eu aliqua magna officia ad laborum sit sint voluptate cupidatat consequat culpa.",
      "nom": "Devoir Maison de BD",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203e16bbc04725b9159",
      "auteur": "Tamika Houston",
      "dateDeRendu": "2018-04-25 20:30:51",
      "rendu": true,
      "note": 5,
      "typeDevoir": "Rattrapage",
      "matiere": "SI",
      "remarques": "Magna consequat consectetur ea elit magna sint est. Pariatur in elit proident aute ut laborum consectetur eiusmod sit in. Amet quis do culpa aliquip excepteur proident excepteur eiusmod officia consequat cillum. Culpa nulla et proident do sit officia ad et. Nisi est aliqua id in ipsum et ad voluptate reprehenderit cupidatat duis nisi voluptate.",
      "nom": "Rattrapage de SI",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203f0fde58af93076da",
      "auteur": "Theresa Donaldson",
      "dateDeRendu": "2020-06-10 06:17:12",
      "rendu": true,
      "note": 8,
      "typeDevoir": "TP",
      "matiere": "Deep Learning",
      "remarques": "Fugiat reprehenderit quis enim labore tempor elit labore consectetur magna aliqua sunt consequat amet. Consectetur proident aute cillum adipisicing esse commodo velit esse ad reprehenderit ut dolor laboris. Sit excepteur excepteur excepteur qui Lorem excepteur elit adipisicing ut quis consectetur quis veniam. Do dolor et Lorem labore exercitation ipsum aute quis ullamco.",
      "nom": "TP de Deep Learning",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203e8c37fa856e667b0",
      "auteur": "Wilcox May",
      "dateDeRendu": "2020-02-18 20:48:48",
      "rendu": true,
      "note": 0,
      "typeDevoir": "TP",
      "matiere": "Angular",
      "remarques": "Ea est Lorem culpa commodo ut commodo est ex veniam dolor ad non id. Ut nisi tempor fugiat est laborum nisi sunt et consequat id aliqua do enim ex. Cillum ullamco eiusmod dolore non nisi dolor aliqua. Est sint non dolor quis velit dolor excepteur dolore laborum exercitation.",
      "nom": "TP de Angular",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203529c1eb10f1aaae2",
      "auteur": "Julianne Sexton",
      "dateDeRendu": "2017-06-11 13:21:38",
      "rendu": true,
      "note": 11,
      "typeDevoir": "Rattrapage",
      "matiere": "SVT",
      "remarques": "Pariatur eu exercitation velit commodo velit anim laboris laboris. Voluptate duis aute laborum amet ea anim occaecat aliquip elit tempor esse in ullamco in. Irure nostrud dolor dolor ut aliqua deserunt aliqua qui ut aute sunt aute consequat. Nulla minim aliqua laborum est consectetur est pariatur. Ut cillum dolor ad commodo nulla occaecat eu amet.",
      "nom": "Rattrapage de SVT",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203358dcdb073d329ff",
      "auteur": "Joyce David",
      "dateDeRendu": "2014-04-17 17:41:35",
      "rendu": true,
      "note": 2,
      "typeDevoir": "Devoir Maison",
      "matiere": "Compta",
      "remarques": "Quis eiusmod amet eu amet sint ea sit. Et minim minim id mollit id eu. Eiusmod sit occaecat enim ea adipisicing minim non cillum culpa elit. Sint sint consequat aliqua irure ex qui sunt magna sit. Quis aliquip elit pariatur eu sint reprehenderit ad pariatur.",
      "nom": "Devoir Maison de Compta",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203c3723f5456ef1b08",
      "auteur": "Shawna Smith",
      "dateDeRendu": "2017-04-09 12:32:37",
      "rendu": true,
      "note": 18,
      "typeDevoir": "TP",
      "matiere": "Machine Learning",
      "remarques": "Eu proident veniam esse cupidatat. Non veniam qui elit ea proident sunt non. Occaecat quis sint incididunt cillum commodo Lorem eiusmod quis ad. Esse magna aliquip commodo in aliqua irure. Aute tempor nisi sint est cillum eu cillum. Dolore ut fugiat veniam proident laboris anim occaecat eu excepteur Lorem aliquip et aliqua.",
      "nom": "TP de Machine Learning",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2038edcaba888605839",
      "auteur": "Gray Albert",
      "dateDeRendu": "2019-10-26 13:24:52",
      "rendu": true,
      "note": 5,
      "typeDevoir": "TP",
      "matiere": "Deep Learning",
      "remarques": "Do non eiusmod excepteur tempor enim consectetur dolor. Reprehenderit irure laborum id aliqua eiusmod. Exercitation et ad minim laboris dolore aliquip aute ea proident incididunt sunt est Lorem sit. Deserunt reprehenderit consectetur eiusmod ea ut ullamco sunt cillum amet laborum ex. Ex ut culpa aliqua dolor.",
      "nom": "TP de Deep Learning",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e20392f16d1bbb21c0ca",
      "auteur": "Claire Wood",
      "dateDeRendu": "2014-01-01 19:09:31",
      "rendu": true,
      "note": 4,
      "typeDevoir": "TD",
      "matiere": "Maths",
      "remarques": "Est minim fugiat eu voluptate consequat ea nisi ea in sit officia magna cillum. Ut esse irure id amet ut exercitation dolor laboris sit commodo. Esse eiusmod pariatur dolor commodo ad reprehenderit dolore fugiat irure voluptate deserunt est magna. Sint consectetur esse ad adipisicing labore. Consequat duis sint amet fugiat amet enim in.",
      "nom": "TD de Maths",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203c2a908ace695a1de",
      "auteur": "Cotton Griffin",
      "dateDeRendu": "2018-03-30 15:20:55",
      "rendu": true,
      "note": 11,
      "typeDevoir": "TD",
      "matiere": "SVT",
      "remarques": "Aliqua ut ad sunt laborum culpa in labore reprehenderit. Est dolor deserunt qui commodo consectetur sunt duis laborum aliquip. Labore pariatur laborum qui quis occaecat fugiat proident. Aliquip labore duis irure aliqua in excepteur. Excepteur non non nisi aute pariatur amet ea quis sint. Consequat proident excepteur non minim sint.",
      "nom": "TD de SVT",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203a12e94c1dacb0225",
      "auteur": "Estelle Hines",
      "dateDeRendu": "2014-03-05 09:55:37",
      "rendu": true,
      "note": 7,
      "typeDevoir": "Rattrapage",
      "matiere": "Maths",
      "remarques": "Qui deserunt reprehenderit cillum qui nostrud eu incididunt consectetur. Tempor dolor anim consectetur ipsum commodo ut incididunt do labore in adipisicing nostrud occaecat. Pariatur tempor officia do laboris dolore cupidatat est tempor fugiat velit cillum. Occaecat cillum non sint aliquip.",
      "nom": "Rattrapage de Maths",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2038bda0eef8d8c400f",
      "auteur": "Vaughan Cobb",
      "dateDeRendu": "2018-06-11 06:09:27",
      "rendu": true,
      "note": 4,
      "typeDevoir": "TP",
      "matiere": "Computer Vision",
      "remarques": "Dolor sunt duis enim mollit non officia dolore proident laborum do esse do eu. Reprehenderit sit enim consectetur ex sint labore consectetur. Irure qui mollit labore id pariatur aute excepteur commodo dolor mollit quis. Incididunt ullamco consectetur deserunt est id nostrud exercitation. Laborum sint sit laborum ad amet. Aliquip anim aliquip ea commodo dolore dolor.",
      "nom": "TP de Computer Vision",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203b646115ce06a7828",
      "auteur": "Perez Keller",
      "dateDeRendu": "2020-07-04 10:37:42",
      "rendu": true,
      "note": 1,
      "typeDevoir": "Partiel",
      "matiere": "Computer Vision",
      "remarques": "Mollit consectetur fugiat dolore esse quis mollit velit duis commodo excepteur culpa commodo. Do in commodo voluptate nisi. Proident veniam aliqua aliqua id cupidatat anim voluptate esse sunt cillum. Dolore proident tempor culpa ut elit sunt amet aliqua aliqua sint ullamco ad qui Lorem.",
      "nom": "Partiel de Computer Vision",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203f4111d48bc403f7e",
      "auteur": "Blake Cook",
      "dateDeRendu": "2020-09-27 18:11:58",
      "rendu": true,
      "note": 9,
      "typeDevoir": "Rattrapage",
      "matiere": "Histoire",
      "remarques": "Magna non aute fugiat anim incididunt. Nostrud velit qui sunt pariatur excepteur dolor irure ullamco amet sint exercitation. Cupidatat aute eiusmod cillum laboris eu do ad dolor veniam velit enim ut eu. Duis nostrud anim sint labore minim irure. Aliquip sit magna minim irure tempor ut enim ipsum cupidatat amet mollit magna. Est esse cupidatat quis quis nostrud deserunt officia in exercitation fugiat ut consequat fugiat proident. Ad tempor in enim amet reprehenderit laborum ut esse ipsum sunt veniam do.",
      "nom": "Rattrapage de Histoire",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203357f1ec9f6010b18",
      "auteur": "Baxter Buchanan",
      "dateDeRendu": "2015-06-24 20:33:40",
      "rendu": true,
      "note": 14,
      "typeDevoir": "TP",
      "matiere": "Compta",
      "remarques": "Consectetur ullamco cillum excepteur mollit. Exercitation id sint nostrud in minim laborum pariatur cupidatat adipisicing ullamco consectetur eiusmod ea. Labore cupidatat non dolore eiusmod.",
      "nom": "TP de Compta",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2039c53048f8cdae0ba",
      "auteur": "Megan Munoz",
      "dateDeRendu": "2017-04-09 05:49:41",
      "rendu": true,
      "note": 7,
      "typeDevoir": "Exercice",
      "matiere": "Computer Vision",
      "remarques": "Id in Lorem sunt dolor exercitation ea consectetur veniam eiusmod qui do. Tempor commodo in veniam eiusmod commodo elit quis do velit minim exercitation qui adipisicing. Cillum sit ex ex sint enim duis officia laborum ullamco. Tempor esse ea ex elit culpa aliqua occaecat. Lorem nulla incididunt ipsum do voluptate aliqua quis culpa ea consequat velit velit. Ad consectetur irure adipisicing dolore adipisicing ut.",
      "nom": "Exercice de Computer Vision",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203644bf31c9471714e",
      "auteur": "Evelyn Blackburn",
      "dateDeRendu": "2020-09-06 15:37:52",
      "rendu": true,
      "note": 20,
      "typeDevoir": "TD",
      "matiere": "SVT",
      "remarques": "In laboris ex adipisicing consectetur magna ut officia incididunt tempor cillum commodo. Laboris sunt duis exercitation fugiat aliquip culpa ut culpa nulla amet Lorem. Aliquip voluptate minim ut esse nulla Lorem veniam cupidatat officia et aliqua labore amet. Ad laborum velit deserunt ut aute veniam quis enim aliqua ullamco veniam in laborum exercitation. Magna dolore cupidatat ad enim quis dolore ut pariatur ea magna in.",
      "nom": "TD de SVT",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e20304d1c3f952af2a51",
      "auteur": "Vicki Burks",
      "dateDeRendu": "2017-09-22 18:13:40",
      "rendu": true,
      "note": 18,
      "typeDevoir": "TD",
      "matiere": "JAVA",
      "remarques": "Lorem excepteur in excepteur dolor sunt reprehenderit occaecat officia. Eiusmod consequat est ullamco labore. Enim reprehenderit veniam anim esse nisi sit nulla tempor aute Lorem laboris ut. Aute ad est magna nulla duis ex nisi duis laborum sit. Incididunt mollit minim occaecat esse in excepteur.",
      "nom": "TD de JAVA",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2033c0db3f3e16f3a15",
      "auteur": "Celia Tran",
      "dateDeRendu": "2014-03-17 16:41:24",
      "rendu": true,
      "note": 17,
      "typeDevoir": "Rattrapage",
      "matiere": "WEB",
      "remarques": "Ipsum quis incididunt cillum do commodo veniam reprehenderit non dolore qui elit enim. Dolore ipsum est officia sunt eiusmod sit consequat nostrud. Est do commodo ullamco proident. Excepteur consectetur commodo fugiat sit est dolore minim elit magna occaecat. Nisi ipsum quis culpa magna ex dolore proident ipsum fugiat excepteur qui occaecat. In elit esse labore Lorem incididunt. Occaecat nulla in et mollit amet nisi nisi labore magna occaecat ullamco ex.",
      "nom": "Rattrapage de WEB",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2032d519430a2ee7c69",
      "auteur": "Ball Gray",
      "dateDeRendu": "2018-09-19 18:12:40",
      "rendu": true,
      "note": 10,
      "typeDevoir": "Rattrapage",
      "matiere": "Angular",
      "remarques": "Velit ea ut non ad consectetur do sint nisi do sunt anim veniam. Qui excepteur dolor cupidatat labore dolor sit excepteur consectetur cillum duis ut et. Quis excepteur qui duis aliquip mollit consectetur magna non occaecat dolore non nisi anim officia. Exercitation dolor duis consectetur pariatur. Ea sint adipisicing pariatur in nisi et. Proident laborum enim ad ut aliquip fugiat non commodo.",
      "nom": "Rattrapage de Angular",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203eb07a8817566fbe2",
      "auteur": "Pauline Shaw",
      "dateDeRendu": "2018-10-17 17:53:57",
      "rendu": true,
      "note": 10,
      "typeDevoir": "Exercice",
      "matiere": "Computer Vision",
      "remarques": "Do aute est reprehenderit id velit officia. In voluptate occaecat exercitation et sint occaecat exercitation elit officia irure veniam ad culpa. Laborum dolor sint ad commodo excepteur labore velit cillum sit in eu.",
      "nom": "Exercice de Computer Vision",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e20378474514b61f6e2e",
      "auteur": "Cunningham Glenn",
      "dateDeRendu": "2018-05-17 15:22:17",
      "rendu": true,
      "note": 18,
      "typeDevoir": "Exercice",
      "matiere": "JAVA",
      "remarques": "Magna est velit fugiat duis sit in velit incididunt occaecat adipisicing fugiat elit duis. Eu et quis dolor commodo excepteur quis Lorem elit. Sunt consequat voluptate sunt consequat velit aliquip fugiat officia dolore aute enim. Eiusmod officia sint duis esse et eu fugiat tempor aliquip minim id commodo laborum. Ad ut adipisicing velit mollit.",
      "nom": "Exercice de JAVA",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2036c9b5b74327c33f1",
      "auteur": "Skinner Bruce",
      "dateDeRendu": "2017-12-06 12:52:19",
      "rendu": true,
      "note": 10,
      "typeDevoir": "Devoir Maison",
      "matiere": "BD",
      "remarques": "Nostrud sit eiusmod ad ad tempor deserunt duis ipsum deserunt eu. Cillum tempor esse fugiat officia nulla cillum cupidatat eu nostrud. Ipsum consequat aliquip pariatur dolore aute culpa voluptate velit ex consectetur irure minim magna. Labore veniam ex cupidatat id minim esse tempor ex.",
      "nom": "Devoir Maison de BD",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e20308a1b07e71bb57f5",
      "auteur": "Morales Schroeder",
      "dateDeRendu": "2017-08-09 16:06:17",
      "rendu": true,
      "note": 14,
      "typeDevoir": "Partiel",
      "matiere": "Compta",
      "remarques": "Est officia culpa mollit mollit irure proident veniam id veniam eu quis. Nostrud duis duis esse incididunt id. Excepteur consequat fugiat cillum pariatur consequat exercitation ut aute id Lorem sit. Nisi aliquip est exercitation veniam quis ullamco est ullamco exercitation Lorem enim in nostrud fugiat. Excepteur est velit qui ullamco occaecat anim.",
      "nom": "Partiel de Compta",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203b356be5b657511f9",
      "auteur": "Priscilla Callahan",
      "dateDeRendu": "2020-08-15 19:37:33",
      "rendu": true,
      "note": 6,
      "typeDevoir": "Devoir Maison",
      "matiere": "Histoire",
      "remarques": "Consequat irure fugiat eu esse. Dolor incididunt consectetur ipsum reprehenderit. Nostrud sit aliqua adipisicing amet deserunt excepteur dolor et aliquip proident laboris proident. Eiusmod aliqua voluptate officia eiusmod ipsum nostrud aliquip. Duis reprehenderit proident velit est Lorem. Voluptate non sint aliqua in laborum esse officia ut et fugiat esse sit.",
      "nom": "Devoir Maison de Histoire",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203d0be90788cddc408",
      "auteur": "Noemi Hill",
      "dateDeRendu": "2017-07-07 11:05:11",
      "rendu": true,
      "note": 18,
      "typeDevoir": "Rattrapage",
      "matiere": "Compta",
      "remarques": "Nostrud minim est occaecat in ut et. Adipisicing minim ipsum commodo fugiat non non quis exercitation ipsum. Sint excepteur sunt ut elit exercitation. Irure cupidatat est voluptate voluptate irure nulla irure eu nostrud est enim nisi ullamco culpa. Esse tempor laboris labore ullamco id adipisicing fugiat sint irure aliqua qui esse aliqua. Ipsum deserunt id ipsum ut ad tempor in duis reprehenderit est amet ex ad irure.",
      "nom": "Rattrapage de Compta",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e20352853a27e8a2b0ec",
      "auteur": "Regina Robinson",
      "dateDeRendu": "2015-12-06 04:25:24",
      "rendu": true,
      "note": 12,
      "typeDevoir": "Partiel",
      "matiere": "BD",
      "remarques": "Excepteur sint exercitation cupidatat do laborum excepteur duis proident est eiusmod ea proident duis aute. Adipisicing esse ut do ex ipsum nulla deserunt nulla veniam id laborum commodo consectetur ipsum. Laboris et non veniam commodo non anim quis laboris. Occaecat do minim velit ut occaecat occaecat culpa dolor labore aliquip commodo labore ex. Cupidatat culpa labore esse anim ipsum.",
      "nom": "Partiel de BD",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203fb032d324698c992",
      "auteur": "Valencia Pruitt",
      "dateDeRendu": "2016-10-24 16:18:22",
      "rendu": true,
      "note": 14,
      "typeDevoir": "Partiel",
      "matiere": "Angular",
      "remarques": "Eu incididunt id minim ut. Nulla dolor cillum duis excepteur sunt labore. Eu non fugiat mollit aliqua laboris non amet sunt id reprehenderit minim irure incididunt mollit.",
      "nom": "Partiel de Angular",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2036e63f57c569dcce7",
      "auteur": "Luz Moreno",
      "dateDeRendu": "2015-04-30 11:51:31",
      "rendu": true,
      "note": 5,
      "typeDevoir": "Partiel",
      "matiere": "SI",
      "remarques": "Officia dolor cupidatat Lorem nisi non reprehenderit occaecat. Sint sint mollit nostrud eiusmod ex ullamco et ad culpa dolor proident sit irure. Elit cillum commodo do elit sit duis culpa. Labore enim eiusmod in nisi. Enim nisi non incididunt enim sint sunt ex commodo do adipisicing. Enim qui do duis voluptate deserunt dolore eiusmod.",
      "nom": "Partiel de SI",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203e02a94eda7f5da84",
      "auteur": "Erica Fleming",
      "dateDeRendu": "2014-11-12 02:44:06",
      "rendu": true,
      "note": 8,
      "typeDevoir": "TP",
      "matiere": "SI",
      "remarques": "Deserunt cillum elit cupidatat do nostrud mollit eu labore ad Lorem ea ullamco sunt aliquip. Esse non deserunt irure culpa eu dolor aute eu officia. Dolore qui mollit eu deserunt quis. Nisi aute occaecat aliquip ea ipsum nisi.",
      "nom": "TP de SI",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2037d819e8dff3bc10b",
      "auteur": "Conway Robertson",
      "dateDeRendu": "2014-10-22 13:36:07",
      "rendu": true,
      "note": 15,
      "typeDevoir": "TP",
      "matiere": "Anglais",
      "remarques": "Ut et do duis culpa est reprehenderit ut incididunt laborum ut ut. Laborum elit voluptate dolor ullamco aliqua sint minim in sunt fugiat et qui veniam. Eiusmod voluptate cillum consequat ullamco dolore ipsum consectetur do enim et enim dolor occaecat.",
      "nom": "TP de Anglais",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2038a17f88f1d78ba7d",
      "auteur": "Mckay Kirk",
      "dateDeRendu": "2015-03-06 14:35:21",
      "rendu": true,
      "note": 1,
      "typeDevoir": "Rattrapage",
      "matiere": "Deep Learning",
      "remarques": "Eiusmod incididunt adipisicing labore cupidatat. Sunt dolore occaecat nulla qui amet nostrud do nulla aliqua. Proident laborum irure sunt sint id fugiat eu dolore eu consequat minim.",
      "nom": "Rattrapage de Deep Learning",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2039937dfc296a39ffe",
      "auteur": "Lynne Bolton",
      "dateDeRendu": "2016-02-09 21:50:12",
      "rendu": true,
      "note": 0,
      "typeDevoir": "TP",
      "matiere": "Anglais",
      "remarques": "Consequat anim deserunt magna consectetur. Occaecat laborum culpa velit adipisicing pariatur adipisicing voluptate sint sit. Tempor fugiat laboris commodo sunt amet do eu.",
      "nom": "TP de Anglais",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203f831023e8b10cfc6",
      "auteur": "Estella Alexander",
      "dateDeRendu": "2019-02-07 07:45:51",
      "rendu": true,
      "note": 16,
      "typeDevoir": "Devoir Maison",
      "matiere": "Angular",
      "remarques": "Occaecat ex aliquip exercitation commodo proident amet culpa. Labore velit cupidatat tempor sint consequat incididunt. Aliquip voluptate culpa cupidatat sunt quis non velit enim laborum non enim id labore. Officia aliqua nulla mollit pariatur cupidatat in aute veniam deserunt consectetur sunt. Deserunt nisi et minim consequat incididunt Lorem incididunt reprehenderit ex sit ex dolore qui.",
      "nom": "Devoir Maison de Angular",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203c66903d600c30e7c",
      "auteur": "Goodman Ramos",
      "dateDeRendu": "2015-01-16 16:16:33",
      "rendu": true,
      "note": 2,
      "typeDevoir": "Exercice",
      "matiere": "SVT",
      "remarques": "Et aute in proident qui esse amet tempor commodo nostrud officia. Culpa dolore do proident laborum aute laboris Lorem nostrud ut. Magna irure ex eu ipsum Lorem amet tempor. Ullamco labore labore culpa esse sunt velit adipisicing non. Nostrud aliqua fugiat duis exercitation laboris adipisicing magna magna esse velit qui proident. Dolor adipisicing nulla ipsum esse qui et.",
      "nom": "Exercice de SVT",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e20346065d2086e89146",
      "auteur": "Horton Ross",
      "dateDeRendu": "2019-01-16 23:10:26",
      "rendu": true,
      "note": 14,
      "typeDevoir": "Partiel",
      "matiere": "Angular",
      "remarques": "In velit sunt sint labore aliqua mollit do ad adipisicing sunt est. Pariatur proident laborum dolore enim elit do consectetur dolor est. Nisi consectetur velit ipsum tempor et consectetur culpa reprehenderit consequat sit id dolor aliquip ea. Nulla minim dolore elit id ut do. Irure irure consectetur sit fugiat consectetur cillum do eu amet minim do. Lorem amet aliquip laboris consectetur dolor mollit esse officia minim ea. Consequat nulla ad tempor officia consectetur id consectetur mollit commodo cillum voluptate consequat laborum id.",
      "nom": "Partiel de Angular",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203b5b01c8153e0dbfe",
      "auteur": "Christian Knowles",
      "dateDeRendu": "2015-03-15 14:21:45",
      "rendu": true,
      "note": 10,
      "typeDevoir": "Rattrapage",
      "matiere": "WEB",
      "remarques": "Excepteur sint qui ex reprehenderit magna velit dolor elit consectetur ut incididunt. Labore ea occaecat velit deserunt tempor. Est qui elit aliquip in laboris eu non aliquip nulla sunt incididunt fugiat. Occaecat eu cupidatat duis esse sit voluptate elit voluptate et cupidatat aute reprehenderit enim. Tempor proident culpa pariatur nulla eiusmod aliqua culpa commodo. Sunt pariatur reprehenderit officia veniam eiusmod. Ut eiusmod ipsum ex ex culpa do occaecat.",
      "nom": "Rattrapage de WEB",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e20338029441c990898d",
      "auteur": "Luann Meadows",
      "dateDeRendu": "2014-03-07 17:04:01",
      "rendu": true,
      "note": 11,
      "typeDevoir": "Devoir Maison",
      "matiere": "Deep Learning",
      "remarques": "Ipsum in deserunt et aliquip fugiat esse cillum consectetur laborum dolore excepteur cillum incididunt. Labore et Lorem est qui minim occaecat sit anim esse ipsum. Id nisi enim incididunt qui Lorem.",
      "nom": "Devoir Maison de Deep Learning",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203f256f151e4b32af3",
      "auteur": "Estrada Foreman",
      "dateDeRendu": "2014-06-03 19:51:15",
      "rendu": true,
      "note": 4,
      "typeDevoir": "TP",
      "matiere": "JAVA",
      "remarques": "Duis fugiat dolore anim do sint sint nisi sint et ea. Laborum cupidatat reprehenderit ut est ut. Do nisi cupidatat sit irure minim esse Lorem.",
      "nom": "TP de JAVA",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2031f615b68d05726a3",
      "auteur": "Reese Mcdaniel",
      "dateDeRendu": "2018-05-17 08:43:37",
      "rendu": true,
      "note": 20,
      "typeDevoir": "TP",
      "matiere": "Computer Vision",
      "remarques": "Sunt consequat id do cupidatat anim minim irure commodo cillum ipsum veniam ipsum labore. Est reprehenderit enim cupidatat culpa in sint voluptate id. Enim tempor in id qui nisi irure incididunt. Excepteur excepteur et occaecat cillum amet culpa id dolore ea aute.",
      "nom": "TP de Computer Vision",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203931654190f816b52",
      "auteur": "Alford Eaton",
      "dateDeRendu": "2021-02-13 13:12:07",
      "rendu": true,
      "note": 12,
      "typeDevoir": "TP",
      "matiere": "Compta",
      "remarques": "Aliquip aute irure incididunt adipisicing ipsum culpa velit adipisicing in id. Sit ea ea nisi aliqua enim. Cillum minim cupidatat amet mollit enim dolor.",
      "nom": "TP de Compta",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203b3b96eace6a7de77",
      "auteur": "Cox Lowe",
      "dateDeRendu": "2020-01-27 00:32:56",
      "rendu": true,
      "note": 20,
      "typeDevoir": "Devoir Maison",
      "matiere": "Machine Learning",
      "remarques": "Aliqua veniam elit adipisicing laboris cupidatat occaecat. Do pariatur laborum ipsum nisi aute sunt Lorem incididunt commodo qui ut reprehenderit nostrud eu. Fugiat reprehenderit consequat exercitation adipisicing adipisicing labore commodo velit est voluptate aute sunt est. Magna veniam fugiat ipsum aute incididunt laboris esse ullamco mollit nostrud eiusmod.",
      "nom": "Devoir Maison de Machine Learning",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e20399f73122a7f4bfb7",
      "auteur": "Vaughn Caldwell",
      "dateDeRendu": "2019-02-07 07:10:38",
      "rendu": true,
      "note": 11,
      "typeDevoir": "Partiel",
      "matiere": "Maths",
      "remarques": "Enim et sint ipsum ut nisi tempor incididunt eu voluptate. Esse veniam cillum ad officia sint. Ea duis do esse fugiat sunt consequat. Anim quis amet tempor est cillum proident elit ipsum eiusmod Lorem. Ut sint esse esse elit et pariatur pariatur est veniam.",
      "nom": "Partiel de Maths",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203cd82c1ba53f63911",
      "auteur": "Kayla Whitley",
      "dateDeRendu": "2020-02-08 21:27:07",
      "rendu": true,
      "note": 10,
      "typeDevoir": "Partiel",
      "matiere": "Machine Learning",
      "remarques": "Eiusmod id ad laborum qui velit aliqua ipsum adipisicing quis proident cupidatat mollit. Reprehenderit esse nulla amet tempor sit elit nisi. Aliqua dolor dolore amet ipsum mollit occaecat aute. Cillum cillum do culpa sit exercitation dolore. Sint nisi exercitation laboris minim non incididunt est nostrud id ad ea sit exercitation ut. Ipsum deserunt duis ullamco reprehenderit labore amet fugiat enim excepteur incididunt.",
      "nom": "Partiel de Machine Learning",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2030c70d9204eef13e2",
      "auteur": "Boyd Decker",
      "dateDeRendu": "2016-10-12 00:36:39",
      "rendu": true,
      "note": 6,
      "typeDevoir": "Exercice",
      "matiere": "Machine Learning",
      "remarques": "Proident eu ipsum esse officia in occaecat mollit. Dolore labore aliqua minim ipsum officia. Qui ut ut veniam elit labore elit nisi magna consequat reprehenderit eiusmod. Deserunt ex exercitation excepteur occaecat magna excepteur quis mollit incididunt id ea aute esse voluptate. Ipsum laboris Lorem reprehenderit commodo enim nisi excepteur consequat enim et enim pariatur tempor in. Id occaecat pariatur ex minim irure anim dolore. Pariatur magna proident laborum magna ullamco adipisicing ex aliquip laboris proident est cupidatat.",
      "nom": "Exercice de Machine Learning",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e20341cf728d44b2f2a8",
      "auteur": "Leticia White",
      "dateDeRendu": "2020-11-13 00:34:11",
      "rendu": true,
      "note": 10,
      "typeDevoir": "Partiel",
      "matiere": "Machine Learning",
      "remarques": "Cillum sunt cupidatat aute officia ut in duis eu sint ad tempor. Sint elit proident excepteur magna proident fugiat excepteur ut magna. Cupidatat sit proident magna velit et officia in laboris anim aliquip ipsum quis.",
      "nom": "Partiel de Machine Learning",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2038f2e10420c913f99",
      "auteur": "Alexandra Camacho",
      "dateDeRendu": "2014-09-27 07:58:06",
      "rendu": true,
      "note": 8,
      "typeDevoir": "TD",
      "matiere": "JAVA",
      "remarques": "Non excepteur ut culpa deserunt laboris commodo veniam consectetur. Culpa quis laborum exercitation amet exercitation laborum velit velit et. Sint cupidatat duis proident eu excepteur adipisicing voluptate excepteur reprehenderit velit amet. Laboris exercitation anim fugiat dolor veniam officia cillum.",
      "nom": "TD de JAVA",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2036d7db15ddc1b08d7",
      "auteur": "Fern Hull",
      "dateDeRendu": "2019-06-14 00:52:42",
      "rendu": true,
      "note": 4,
      "typeDevoir": "Partiel",
      "matiere": "Anglais",
      "remarques": "Nostrud incididunt eiusmod esse deserunt. Tempor dolor et do pariatur fugiat. Esse laborum commodo anim voluptate proident est veniam pariatur pariatur mollit cillum do ad. In consectetur est reprehenderit aliqua est deserunt nulla ex.",
      "nom": "Partiel de Anglais",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203b5e0835680bcea86",
      "auteur": "Anne Melendez",
      "dateDeRendu": "2019-04-12 08:47:10",
      "rendu": true,
      "note": 16,
      "typeDevoir": "Partiel",
      "matiere": "Deep Learning",
      "remarques": "Elit cillum esse elit ut cupidatat. Fugiat ea eiusmod officia minim dolor non ea do. Laborum laboris aliqua Lorem eiusmod proident proident.",
      "nom": "Partiel de Deep Learning",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2030605bd933d6c0e05",
      "auteur": "Leta Knox",
      "dateDeRendu": "2021-02-10 16:30:26",
      "rendu": true,
      "note": 15,
      "typeDevoir": "Devoir Maison",
      "matiere": "Histoire",
      "remarques": "Nisi ipsum incididunt laboris eu elit ullamco aliqua qui non. Voluptate tempor eu sit occaecat deserunt. Velit magna occaecat aliqua qui ex Lorem ullamco amet cillum ad commodo irure tempor. Veniam duis mollit incididunt aliqua laborum fugiat et ullamco amet pariatur mollit. Proident officia commodo et voluptate quis mollit cillum proident aliquip deserunt pariatur.",
      "nom": "Devoir Maison de Histoire",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203e99fd1407fd2a94b",
      "auteur": "Josephine Dickerson",
      "dateDeRendu": "2019-01-13 10:14:19",
      "rendu": true,
      "note": 13,
      "typeDevoir": "TD",
      "matiere": "Histoire",
      "remarques": "Proident dolor duis ipsum adipisicing ea deserunt cillum culpa eu. Elit aliquip anim do aliquip elit Lorem consequat consequat occaecat est nulla consequat. Proident nulla id quis reprehenderit nostrud labore esse ad officia ut duis adipisicing qui. Veniam labore non magna in duis qui mollit enim consequat amet. Ex mollit mollit elit excepteur mollit. Proident pariatur mollit id voluptate aliquip excepteur laboris consectetur.",
      "nom": "TD de Histoire",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2035d6c25c6ba0165bc",
      "auteur": "Olive Hahn",
      "dateDeRendu": "2019-12-11 07:41:24",
      "rendu": true,
      "note": 18,
      "typeDevoir": "Exercice",
      "matiere": "SI",
      "remarques": "Officia deserunt nisi laboris eu ut. Id aliquip veniam deserunt id irure laborum velit cillum exercitation cupidatat quis duis enim. Eu Lorem quis sint laborum laboris pariatur commodo dolor proident excepteur mollit cupidatat tempor. Ut magna tempor occaecat est do mollit nostrud commodo et Lorem sunt esse laborum. Nostrud adipisicing minim eiusmod adipisicing voluptate adipisicing. Nisi aliqua esse eu enim exercitation aute exercitation pariatur officia ad et. Et velit laborum veniam deserunt.",
      "nom": "Exercice de SI",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203b4a5493da92a5ef6",
      "auteur": "Nona Wiley",
      "dateDeRendu": "2019-03-03 06:55:03",
      "rendu": true,
      "note": 18,
      "typeDevoir": "Rattrapage",
      "matiere": "SI",
      "remarques": "Est mollit eiusmod est do labore nulla consequat deserunt qui quis. Ea aliqua nulla non exercitation adipisicing tempor ipsum dolor minim. Magna quis sunt anim aliquip pariatur voluptate. Ut adipisicing non eiusmod elit incididunt sit exercitation. Occaecat nulla proident qui ullamco Lorem non quis.",
      "nom": "Rattrapage de SI",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e20343c1588a1dcb3855",
      "auteur": "Stella Pierce",
      "dateDeRendu": "2019-01-19 19:45:12",
      "rendu": true,
      "note": 6,
      "typeDevoir": "TD",
      "matiere": "Machine Learning",
      "remarques": "Occaecat eiusmod do aliquip esse cupidatat esse cupidatat ea incididunt consequat do. Qui anim adipisicing ut et sint excepteur magna eiusmod irure enim et exercitation dolor. Nisi pariatur quis dolor exercitation exercitation exercitation ipsum elit culpa ullamco cillum non qui. Excepteur elit elit excepteur irure. Pariatur culpa excepteur reprehenderit sunt labore cupidatat aute aliqua laborum non consectetur. Ea consequat do reprehenderit irure ea labore.",
      "nom": "TD de Machine Learning",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e20310e4bfd50c7967f9",
      "auteur": "Velma Huber",
      "dateDeRendu": "2017-10-28 07:58:59",
      "rendu": true,
      "note": 15,
      "typeDevoir": "TD",
      "matiere": "Angular",
      "remarques": "Culpa ipsum non anim eu ut ex duis aute. Tempor cupidatat reprehenderit pariatur officia. Est reprehenderit ullamco mollit laboris pariatur et eiusmod deserunt esse elit enim magna. Quis commodo aliquip nulla id incididunt laborum. Quis ea sint ea proident veniam incididunt exercitation ut consectetur do ea et.",
      "nom": "TD de Angular",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e20354b57462cdf9e280",
      "auteur": "Summers Walton",
      "dateDeRendu": "2015-11-28 11:15:02",
      "rendu": true,
      "note": 14,
      "typeDevoir": "Devoir Maison",
      "matiere": "Compta",
      "remarques": "Sit amet velit duis irure ex consectetur. Anim nostrud aute tempor cillum adipisicing. Ipsum amet nisi commodo qui quis minim mollit aute. Qui enim excepteur amet cillum ipsum.",
      "nom": "Devoir Maison de Compta",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2037852376a273f5453",
      "auteur": "Lakisha Velasquez",
      "dateDeRendu": "2016-05-07 21:14:28",
      "rendu": true,
      "note": 4,
      "typeDevoir": "TD",
      "matiere": "Maths",
      "remarques": "Mollit enim excepteur velit mollit sunt magna non cupidatat ut ex adipisicing ut cillum. Qui non laboris labore culpa culpa sit pariatur nostrud id. Est ipsum eiusmod eiusmod proident deserunt nisi mollit duis exercitation ad nisi exercitation eu. Eu eu dolor nostrud et esse. Qui commodo dolor amet voluptate. Qui in ipsum dolore ipsum elit exercitation dolore nostrud. Est mollit aute sunt labore labore reprehenderit aute tempor.",
      "nom": "TD de Maths",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203298f833e19d3746a",
      "auteur": "Mason Padilla",
      "dateDeRendu": "2014-12-19 07:53:47",
      "rendu": true,
      "note": 17,
      "typeDevoir": "Partiel",
      "matiere": "JAVA",
      "remarques": "Nulla sunt incididunt sunt aliquip laboris occaecat anim. Reprehenderit nisi mollit id velit. Voluptate quis magna id amet et ex aute est anim ipsum sit ad. Mollit deserunt non sunt nisi do elit. Cupidatat amet eiusmod nulla esse ipsum fugiat nulla consequat cillum. In laborum pariatur sunt in veniam laboris. In eiusmod culpa eu aliquip tempor cillum et non occaecat.",
      "nom": "Partiel de JAVA",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203230a0ed821ff8ec1",
      "auteur": "Shauna Coffey",
      "dateDeRendu": "2019-06-23 00:41:57",
      "rendu": true,
      "note": 4,
      "typeDevoir": "Rattrapage",
      "matiere": "Maths",
      "remarques": "Do est commodo nulla enim do aute cupidatat quis. Eu proident nostrud culpa laboris sit dolor reprehenderit laboris do laborum. Culpa sunt culpa elit irure non magna proident in anim esse. Ut enim id voluptate culpa nulla id reprehenderit Lorem reprehenderit culpa magna. Laborum officia reprehenderit excepteur deserunt Lorem amet cillum laborum ad sit. Nisi elit ut dolore aute duis fugiat id cillum et. Quis minim sit ex ipsum elit ad mollit quis quis ex dolor esse.",
      "nom": "Rattrapage de Maths",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203b3847838484cfb9a",
      "auteur": "Reed Moon",
      "dateDeRendu": "2020-06-03 18:35:30",
      "rendu": true,
      "note": 14,
      "typeDevoir": "Partiel",
      "matiere": "Computer Vision",
      "remarques": "Consequat dolore velit est consectetur laboris consectetur. Veniam elit ea esse veniam voluptate consequat nulla quis tempor commodo cillum nisi ut exercitation. Cupidatat qui sunt voluptate ullamco incididunt deserunt. Aliquip exercitation dolore anim laboris ad consequat exercitation aliquip ullamco in est occaecat dolore. Ut sit officia ea cillum nulla voluptate ut elit nisi eu voluptate amet sint. Magna commodo duis Lorem non. Veniam id reprehenderit culpa officia laboris.",
      "nom": "Partiel de Computer Vision",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203f9bfb95164587e0a",
      "auteur": "Jaclyn Gibson",
      "dateDeRendu": "2017-10-26 12:54:36",
      "rendu": true,
      "note": 19,
      "typeDevoir": "TD",
      "matiere": "Machine Learning",
      "remarques": "Laborum labore aliqua qui proident. Irure sunt non in nulla magna consequat do tempor laborum labore tempor aliqua. Adipisicing qui qui minim ipsum amet officia fugiat ullamco nulla mollit.",
      "nom": "TD de Machine Learning",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203f8ae43ab15e088c8",
      "auteur": "Judith Lambert",
      "dateDeRendu": "2019-08-20 06:52:12",
      "rendu": true,
      "note": 4,
      "typeDevoir": "TD",
      "matiere": "BD",
      "remarques": "Aliqua ut incididunt Lorem do eiusmod consectetur in esse. Aliqua in ut nisi ullamco amet sit. Dolor duis reprehenderit cupidatat fugiat nisi nulla enim elit eiusmod aliquip. Pariatur irure nulla in reprehenderit pariatur. Magna ad tempor in ea fugiat nulla occaecat fugiat laboris. Dolor tempor pariatur est fugiat sunt mollit id.",
      "nom": "TD de BD",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203e0d4847044a07717",
      "auteur": "Darlene Snyder",
      "dateDeRendu": "2016-09-01 22:15:11",
      "rendu": true,
      "note": 8,
      "typeDevoir": "Rattrapage",
      "matiere": "Compta",
      "remarques": "Nulla ullamco ex sunt velit labore proident occaecat. Mollit dolor laborum veniam deserunt amet mollit mollit eiusmod. Officia nostrud laboris enim mollit esse aute. Amet ad mollit occaecat ullamco velit sint elit reprehenderit dolor est. Et Lorem laboris do in cupidatat laborum proident cillum aliquip mollit magna ex occaecat.",
      "nom": "Rattrapage de Compta",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203b9f66523b6a5d12b",
      "auteur": "Reid Stafford",
      "dateDeRendu": "2020-04-21 01:21:41",
      "rendu": true,
      "note": 4,
      "typeDevoir": "Rattrapage",
      "matiere": "Angular",
      "remarques": "Lorem tempor nisi ad amet do ex laboris duis culpa. Nulla proident cillum cillum eiusmod veniam sint. Officia sunt eu excepteur dolore minim excepteur adipisicing proident id consectetur esse. Exercitation cillum est irure sint deserunt. Exercitation reprehenderit aliquip consequat enim excepteur cillum exercitation do ex irure aliqua ullamco do eiusmod. Fugiat irure veniam minim velit voluptate consequat laboris commodo id mollit. Ad occaecat mollit amet veniam reprehenderit esse ullamco non aliqua duis minim.",
      "nom": "Rattrapage de Angular",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203abe2e6571aa09f60",
      "auteur": "Mcintosh Conrad",
      "dateDeRendu": "2014-09-10 16:57:47",
      "rendu": true,
      "note": 9,
      "typeDevoir": "Partiel",
      "matiere": "WEB",
      "remarques": "Et sint ut laboris veniam ut nisi enim esse pariatur anim nostrud. Anim incididunt amet aliquip commodo mollit ut nostrud aliquip irure incididunt proident. Laborum cillum deserunt nisi in incididunt consectetur fugiat laborum ipsum magna mollit non ex.",
      "nom": "Partiel de WEB",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203a09b8b84c9d60e88",
      "auteur": "Moss Soto",
      "dateDeRendu": "2017-04-23 17:41:55",
      "rendu": true,
      "note": 0,
      "typeDevoir": "Exercice",
      "matiere": "WEB",
      "remarques": "Minim labore consectetur id consectetur veniam et pariatur aliquip ex. Fugiat elit id nisi ea eu exercitation ipsum esse laborum mollit in. Deserunt magna pariatur cillum irure Lorem aute fugiat consectetur pariatur voluptate.",
      "nom": "Exercice de WEB",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2034bfc0444b4102277",
      "auteur": "Mcneil Hansen",
      "dateDeRendu": "2017-05-09 06:38:14",
      "rendu": true,
      "note": 5,
      "typeDevoir": "Exercice",
      "matiere": "WEB",
      "remarques": "Ea velit aliqua do exercitation et enim. Laborum amet sit dolor ea ea esse irure aliqua Lorem Lorem. Minim elit ex nulla veniam voluptate qui do ullamco. Aliquip cillum amet eu elit ea cupidatat incididunt non fugiat aliquip amet fugiat irure.",
      "nom": "Exercice de WEB",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203311c5ba847949ff2",
      "auteur": "Kennedy Vega",
      "dateDeRendu": "2019-09-17 05:19:25",
      "rendu": true,
      "note": 17,
      "typeDevoir": "TD",
      "matiere": "WEB",
      "remarques": "Cupidatat ad qui incididunt irure laboris consectetur minim. Aliquip adipisicing non fugiat cupidatat sit incididunt laboris excepteur veniam fugiat. Irure laborum non voluptate et aliquip cillum. Incididunt in tempor exercitation tempor est eiusmod.",
      "nom": "TD de WEB",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e20322c26ec780c2c75b",
      "auteur": "Wilder Conley",
      "dateDeRendu": "2018-03-16 09:42:01",
      "rendu": true,
      "note": 12,
      "typeDevoir": "TD",
      "matiere": "Computer Vision",
      "remarques": "Occaecat proident aute nisi deserunt ex adipisicing duis eu tempor qui veniam ex Lorem. Sint velit veniam mollit reprehenderit nisi cupidatat do sit reprehenderit exercitation. Ea esse ea culpa ut veniam deserunt id sint commodo occaecat.",
      "nom": "TD de Computer Vision",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2039a3c64d6ae41263e",
      "auteur": "Toni Burris",
      "dateDeRendu": "2017-04-23 12:59:39",
      "rendu": true,
      "note": 2,
      "typeDevoir": "TP",
      "matiere": "Angular",
      "remarques": "Pariatur duis ipsum labore deserunt veniam elit sunt. Aute consectetur veniam ex est dolore. Ea veniam proident culpa ut. Commodo incididunt quis et esse eiusmod ipsum nostrud aliquip proident. Nulla velit ad laborum eu qui. Et ullamco consequat ex ea cupidatat. Excepteur nulla ea cillum aute ut nisi est nostrud consectetur eiusmod magna est.",
      "nom": "TP de Angular",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2039109772b724d5642",
      "auteur": "Virgie Giles",
      "dateDeRendu": "2017-01-14 06:33:13",
      "rendu": true,
      "note": 18,
      "typeDevoir": "Rattrapage",
      "matiere": "SVT",
      "remarques": "Reprehenderit proident duis ea consectetur labore nostrud ad exercitation cupidatat esse eu. Nostrud esse ad aliqua irure et. Laboris adipisicing adipisicing officia cillum pariatur amet nisi minim eiusmod esse sint.",
      "nom": "Rattrapage de SVT",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e203e590bfd2eaaac3bd",
      "auteur": "Cassandra Miles",
      "dateDeRendu": "2019-12-27 17:32:55",
      "rendu": true,
      "note": 18,
      "typeDevoir": "TP",
      "matiere": "JAVA",
      "remarques": "Sunt ut do minim anim laborum anim. Deserunt excepteur exercitation consequat id ad ipsum nulla. Velit est officia ad dolore incididunt. Consequat magna consequat Lorem ea laborum id tempor.",
      "nom": "TP de JAVA",
      "image": "https://picsum.photos/200"
    },
    {
      "_id": "6051e2039eac67f233199be4",
      "auteur": "Powell Nguyen",
      "dateDeRendu": "2014-02-22 17:04:28",
      "rendu": true,
      "note": 5,
      "typeDevoir": "Rattrapage",
      "matiere": "WEB",
      "remarques": "Occaecat culpa in commodo consequat ullamco. Eiusmod aute sint aliqua et qui do ipsum nulla. Culpa id deserunt id cillum proident tempor sint voluptate aliqua. Consectetur quis voluptate dolor do minim aliquip ut dolore consequat ad pariatur est laborum. Commodo culpa laborum fugiat veniam voluptate elit sint anim aute aliquip ipsum do incididunt.",
      "nom": "Rattrapage de WEB",
      "image": "https://picsum.photos/200"
    }
  ]